#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/FIAP-Lanchonete-G41/lambda-authorizer/runs/run-wzKHQTbr3hVp33nF

Waiting for the plan to start...

Terraform v1.10.2
on linux_amd64
Initializing plugins and modules...
data.aws_lb.eks_nlb: Refreshing...
data.aws_apigatewayv2_api.api_gateway: Refreshing...
data.aws_iam_role.lab_role: Refreshing...
data.aws_apigatewayv2_vpc_link.vpc_link: Refreshing...
data.aws_iam_role.lab_role: Refresh complete after 0s [id=LabRole]
aws_lambda_function.authorizer: Refreshing state... [id=cognito-authorizer]
data.aws_apigatewayv2_api.api_gateway: Refresh complete after 0s [id=yedv13j998]
data.aws_apigatewayv2_vpc_link.vpc_link: Refresh complete after 0s [id=ebxfqq]
data.aws_lb.eks_nlb: Refresh complete after 0s [id=arn:aws:elasticloadbalancing:us-east-1:721525683170:loadbalancer/net/ac0fdbc39f9ba4570925a34eca495401/624d2cd76756a4b5]
data.aws_lb_listener.eks_listener: Refreshing...
aws_apigatewayv2_authorizer.lambda_authorizer: Refreshing state... [id=0gryey]
data.aws_lb_listener.eks_listener: Refresh complete after 0s [id=arn:aws:elasticloadbalancing:us-east-1:721525683170:listener/net/ac0fdbc39f9ba4570925a34eca495401/624d2cd76756a4b5/9aca6fffd1ddcf23]
aws_apigatewayv2_integration.eks_integration: Refreshing state... [id=tt1k2id]
aws_apigatewayv2_route.eks_route_with_auth: Refreshing state... [id=p7jo6tm]
aws_apigatewayv2_route.docs_route: Refreshing state... [id=d20xbwf]
aws_apigatewayv2_route.docs_route: Drift detected (update)
aws_apigatewayv2_integration.eks_integration: Drift detected (update)
aws_apigatewayv2_route.eks_route_with_auth: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # aws_lambda_function.authorizer will be updated in-place
  ~ resource "aws_lambda_function" "authorizer" {
        id                             = "cognito-authorizer"
      ~ last_modified                  = "2024-12-17T03:48:12.736+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:721525683170:function:cognito-authorizer:8" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:721525683170:function:cognito-authorizer:8/invocations" -> (known after apply)
      ~ source_code_hash               = "tox915gW5VbEtHzl9dEiSmdxqPVRLm/efR0f9lEJ+Xg=" -> "su0ysiQiyAyu3cSUXsX/QrZ1STbMPZeO9+ER5GPn5TA="
        tags                           = {}
      ~ version                        = "8" -> (known after apply)
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @rafaelvmasc, Action: `pull_request`*